In [11]:
import pandas as pd

data = pd.read_csv('clientes.txt')

customer = pd.DataFrame(data)
customer

    nombre  edad  ingreso
0     Juan  35.0  15800.0
1    Luisa  25.0  17000.0
2      NaN  70.0  20000.0
3   Carmen  49.0  22000.0
4      NaN   NaN      NaN
5    Mario  30.0  15800.0
6    Pedro   NaN  17400.0
7  Gustavo  27.0      NaN
8   Carlos   NaN      NaN

In [4]:
customer["nombre"].isnull()

0    False
1    False
2     True
3    False
4     True
5    False
6    False
7    False
8    False
Name: nombre, dtype: bool

In [5]:
customer[customer["nombre"].isnull()]

  nombre  edad  ingreso
2    NaN  70.0  20000.0
4    NaN   NaN      NaN

In [6]:
print(customer.dropna())

   nombre  edad  ingreso
0    Juan  35.0  15800.0
1   Luisa  25.0  17000.0
3  Carmen  49.0  22000.0
5   Mario  30.0  15800.0

In [7]:
print(customer)

    nombre  edad  ingreso
0     Juan  35.0  15800.0
1    Luisa  25.0  17000.0
2      NaN  70.0  20000.0
3   Carmen  49.0  22000.0
4      NaN   NaN      NaN
5    Mario  30.0  15800.0
6    Pedro   NaN  17400.0
7  Gustavo  27.0      NaN
8   Carlos   NaN      NaN

In [8]:
print(customer.dropna(subset=["nombre","ingreso"]))

   nombre  edad  ingreso
0    Juan  35.0  15800.0
1   Luisa  25.0  17000.0
3  Carmen  49.0  22000.0
5   Mario  30.0  15800.0
6   Pedro   NaN  17400.0

In [9]:
customer

    nombre  edad  ingreso
0     Juan  35.0  15800.0
1    Luisa  25.0  17000.0
2      NaN  70.0  20000.0
3   Carmen  49.0  22000.0
4      NaN   NaN      NaN
5    Mario  30.0  15800.0
6    Pedro   NaN  17400.0
7  Gustavo  27.0      NaN
8   Carlos   NaN      NaN

In [10]:
print(customer.dropna(subset=["nombre","ingreso"], inplace=True))
customer

None

   nombre  edad  ingreso
0    Juan  35.0  15800.0
1   Luisa  25.0  17000.0
3  Carmen  49.0  22000.0
5   Mario  30.0  15800.0
6   Pedro   NaN  17400.0

### Clean all null

In [12]:
print(customer.fillna(0)) # fill with zeros all nulls

    nombre  edad  ingreso
0     Juan  35.0  15800.0
1    Luisa  25.0  17000.0
2        0  70.0  20000.0
3   Carmen  49.0  22000.0
4        0   0.0      0.0
5    Mario  30.0  15800.0
6    Pedro   0.0  17400.0
7  Gustavo  27.0      0.0
8   Carlos   0.0      0.0

In [13]:
print(customer["nombre"].fillna("unknown")) # fill with unknown all nulls in the column "name"

0       Juan
1      Luisa
2    unknown
3     Carmen
4    unknown
5      Mario
6      Pedro
7    Gustavo
8     Carlos
Name: nombre, dtype: object

In [15]:
values_by_default = {"nombre": "unknown",
                    "edad": 18,
                    "ingreso": 10000}
print(customer.fillna(value=values_by_default))

    nombre  edad  ingreso
0     Juan  35.0  15800.0
1    Luisa  25.0  17000.0
2  unknown  70.0  20000.0
3   Carmen  49.0  22000.0
4  unknown  18.0  10000.0
5    Mario  30.0  15800.0
6    Pedro  18.0  17400.0
7  Gustavo  27.0  10000.0
8   Carlos  18.0  10000.0

In [31]:
mean_income   = customer["ingreso"].mean()
median_income = customer["ingreso"].median()
mode_income   = customer["ingreso"].mode()[0]
print(mean_income, median_income, mode_income)

18000.0 17200.0 15800.0

In [24]:
mode_income

0    15800.0
Name: ingreso, dtype: float64

In [28]:
print(customer["ingreso"].fillna(mean_income))

0    15800.0
1    17000.0
2    20000.0
3    22000.0
4    18000.0
5    15800.0
6    17400.0
7    18000.0
8    18000.0
Name: ingreso, dtype: float64